# ---------------------------------------------------------------------------------
# Переписать программу из задания 10 с использованием модуля argparse. Считать аргументы a, b и c позиционными.
# Добавить опциональный аргумент -с или --complex, при наличии этого аргумента результаты выводить в виде комплексных чисел.
# ---------------------------------------------------------------------------------
import argparse
import math
import cmath




def main(a, b, c, complex):
    """
    >>> main(1, 4, 3, False)
    'Корни уравнения: -1.0 -3.0'
    >>> main(1, 4, 3, True)
    'Комплексные корни уравнения: (-1+0j) (-3+0j)'
    >>> main(0, 4, 3, True)
    "Argument 'a' must be != 0"
    :rtype: object
    """
    if a == 0:
        return "Argument 'a' must be != 0"

    d = b ** 2 - 4 * a * c
    if complex:
        x1 = (-b + cmath.sqrt(d)) / (2 * a)
        x2 = (-b - cmath.sqrt(d)) / (2 * a)
        return f"Комплексные корни уравнения: {x1} {x2}"
    else:
        if d < 0:
            return "Нет решения"
        elif d == 0:
            x = -b / 2 * a
            return f"Корень уравнения: {x}"
        else:
            x1 = (-b + math.sqrt(d)) / (2 * a)
            x2 = (-b - math.sqrt(d)) / (2 * a)
            return f"Корни уравнения: {x1} {x2}"


