# ---------------------------------------------------------------------------------
# С помощью модуля sys напишите программу, которая принимает три параметра (a, b, c) и выводит
# результат решения квардратного уравнения. ax^2 + bx + c = 0
# Например:
# $ ./solve.py 1 4 3
# -1 -3
# ---------------------------------------------------------------------------------
import sys
import math


def main(value):
    r"""
    :param value: Три вволимых числа
    :return: Результат выполнения
    Выводит результат решения квардратного уравнения.
    >>> main(['1', '2', '3'])
    'Корней нет'
    >>> main(['1', '-5', '6'])
    'x1 = 3.0\nx2 = 2.0'
    """

    value = list(map(int, value))
    discr = value[1] ** 2 - 4 * value[0] * value[2]

    if discr > 0:
        x1 = (-value[1] + math.sqrt(discr)) / (2 * value[0])
        x2 = (-value[1] - math.sqrt(discr)) / (2 * value[0])
        return f'x1 = {round(x1,2)}\nx2 = {round(x2, 2)}'
    elif discr == 0:
        x1 = -(value[1] / 2 * value[0])
        return f'x1 = {round(x1, 2)}'
    else:
        return 'Корней нет'




